IlanCosman/clownfish
PatrickF1/colored_man_pages.fish
PatrickF1/fzf.fish
franciscolourenco/done
halostatue/fish-brew@v3.x
halostatue/fish-direnv@v1.x
halostatue/fish-docker@v1.x
halostatue/fish-elixir@v1.x
halostatue/fish-go@v2.x
halostatue/fish-haskell@v2.x
halostatue/fish-kerl@v1.x
halostatue/fish-machine-config@v1.x
halostatue/fish-macos@v5.x
halostatue/fish-rake@v1.x
halostatue/fish-rust@v1.x
halostatue/fish-utils-core@v2.x
halostatue/fish-utils-net@v1.x
halostatue/fish-utils@v3.x
halostatue/fish-vendor-completions@v1.x
jorgebucaran/autopair.fish
jorgebucaran/fishtape
lilyball/nix-env.fish
oh-my-fish/plugin-tab
jorgebucaran/fisher
halostatue/sponge@fix-init-failures
gazorby/fish-abbreviation-tips@v0.7.0
nickeb96/puffer-fish
halostatue/gitlater@v1.0.0
ilancosman/tide@v6
