jorgebucaran/fisher
halostatue/fish-utils-core@v2.x
ilancosman/clownfish
patrickf1/colored_man_pages.fish
patrickf1/fzf.fish@v10.3
halostatue/fish-brew@v3.x
halostatue/fish-elixir@v1.x
halostatue/fish-go@v2.x
halostatue/fish-haskell@v2.x
halostatue/fish-kerl@v1.x
halostatue/fish-utils@v3.x
halostatue/fish-utils-net@v1.x
halostatue/fish-macos@v5.x
halostatue/fish-machine-config@v1.x
halostatue/fish-rake@v1.x
halostatue/fish-rust@v1.x
halostatue/fish-vendor-completions@v1.x
jorgebucaran/autopair.fish
jorgebucaran/fishtape
lilyball/nix-env.fish
oh-my-fish/plugin-tab
halostatue/sponge@fix-init-failures
nickeb96/puffer-fish
halostatue/gitlater@v1.0.0
kpbaks/autols.fish
adamchristiansen/vertical-fish
kidonng/preview.fish
