jorgebucaran/fisher
ilancosman/clownfish
patrickf1/colored_man_pages.fish
patrickf1/fzf.fish@v10.3
jorgebucaran/autopair.fish
jorgebucaran/fishtape
oh-my-fish/plugin-tab
halostatue/sponge@fix-init-failures
kpbaks/autols.fish
kidonng/preview.fish
halostatue/fish-brew@v3
halostatue/fish-elixir@v2
halostatue/fish-go@v2
halostatue/fish-haskell@v2
halostatue/fish-machine-config@v1
halostatue/fish-macos@v7
halostatue/fish-macports@v1
halostatue/fish-mise@v1
halostatue/fish-rake@v1
halostatue/fish-ruby-bundler@v2
halostatue/fish-rust@v2
halostatue/fish-utils-core@v3
halostatue/fish-utils-net@v2
halostatue/fish-utils@v4
halostatue/fish-vendor-completions@v2-beta
lilyball/alt-q.fish
ilancosman/tide@v6
