tap "adoptopenjdk/openjdk"
tap "apparition47/tap"
tap "d12frosted/emacs-plus"
tap "domt4/autoupdate"
tap "dteoh/sqa"
tap "equalsraf/neovim-qt"
tap "github/gh"
tap "heroku/brew"
tap "hmarr/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jotaen/klog"
tap "melonamin/formulae"
tap "muesli/tap"
tap "orf/brew"
tap "petere/postgresql"
tap "puma/puma"
tap "robotsandpencils/made"
tap "screenplaydev/tap"
tap "sqitchers/sqitch"
tap "unused-code/formulae"
tap "wez/wezterm"
tap "ycd/tap"
brew "adr-tools"
brew "age"
brew "amfora"
brew "ansifilter"
brew "aria2"
brew "aspell"
brew "autoconf"
brew "automake"
brew "bash"
brew "coreutils"
brew "bats-core"
brew "bison"
brew "gdbm"
brew "gettext"
brew "libffi"
brew "pcre"
brew "xz"
brew "python@3.9"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "catimg"
brew "imagemagick"
brew "chafa"
brew "chezmoi"
brew "chruby"
brew "pcre2"
brew "fish"
brew "chruby-fish"
brew "cloc"
brew "comby"
brew "cpanminus"
brew "csvtk"
brew "ctags"
brew "deno"
brew "diff-so-fancy"
brew "direnv"
brew "docui"
brew "dos2unix"
brew "duf"
brew "epubcheck"
brew "exact-image"
brew "fossil"
brew "fping"
brew "fribidi"
brew "fzf"
brew "fzy"
brew "gawk"
brew "gd"
brew "libpq"
brew "poppler-qt5"
brew "gdal"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glow"
brew "libidn2"
brew "unbound", restart_service: true
brew "go"
brew "gobject-introspection"
brew "terminal-notifier"
brew "gopass"
brew "jasper"
brew "graphicsmagick"
brew "harfbuzz"
brew "librsvg"
brew "graphviz"
brew "lua"
brew "highlight"
brew "htop"
brew "hub"
brew "jemalloc"
brew "jq"
brew "jrnl"
brew "kerl"
brew "lazydocker"
brew "lazygit"
brew "libgit2"
brew "libsecret"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "links"
brew "lnav"
brew "make"
brew "mas"
brew "metabase", link: false
brew "miller"
brew "monolith"
brew "moreutils"
brew "msgpack"
brew "murex"
brew "neovim"
brew "nghttp2"
brew "nim"
brew "nmap"
brew "node"
brew "oil"
brew "packer"
brew "pandoc"
brew "tree"
brew "pass"
brew "perl"
brew "pgcli"
brew "pipx"
brew "poppler"
brew "pv"
brew "qprint"
brew "ranger"
brew "redis", restart_service: true
brew "ruby-build"
brew "ruby-install"
brew "scc"
brew "sdl2"
brew "shellcheck"
brew "shfmt"
brew "subversion"
brew "swift-format"
brew "swiftformat"
brew "terraform"
brew "textql"
brew "the_silver_searcher"
brew "tig"
brew "tnef"
brew "todo-txt"
brew "tz"
brew "vifm"
brew "w3m"
brew "wget"
brew "wxwidgets"
brew "yq"
brew "zola"
brew "equalsraf/neovim-qt/neovim-qt"
brew "heroku/brew/heroku"
brew "puma/puma/puma-dev"
brew "screenplaydev/tap/graphite"
brew "ycd/tap/dstp"
cask "1password-cli"
cask "adoptopenjdk13"
cask "alacritty"
cask "alfred"
cask "anydesk"
cask "autodmg"
cask "azure-data-studio"
cask "bbedit"
cask "calibre"
cask "charles"
cask "chromium"
cask "deepl"
cask "desktoppr"
cask "discord"
cask "docker"
cask "dotnet-sdk"

cask "eaglefiler"
cask "esse"
cask "figma"
cask "figmadaemon"
cask "finicky"
cask "firefox"
cask "fluid"

cask "font-abel"
cask "font-aileron"
cask "font-alegreya"
cask "font-alegreya-sans"
cask "font-alice"
cask "font-andada"
cask "font-anonymous-pro"
cask "font-antic"
cask "font-antic-didone"
cask "font-antic-slab"
cask "font-average"
cask "font-average-sans"
cask "font-balthazar"
cask "font-bebas-neue"
cask "font-bitstream-vera"
cask "font-blackout"
cask "font-blokk-neue"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-chapbook"
cask "font-clear-sans"
cask "font-comic-mono"
cask "font-comic-neue"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-medium-and-semi-bold"
cask "font-courier-prime-sans"
cask "font-della-respira"
cask "font-eb-garamond"
cask "font-et-book"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-gentium-basic"
cask "font-gentium-book-basic"
cask "font-gentium-plus"
cask "font-go"
cask "font-hack"
cask "font-hasklig"
cask "font-ibm-plex"
cask "font-inconsolata"
cask "font-input"
cask "font-iosevka"
cask "font-jaapokki"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-lato"
cask "font-league-gothic"
cask "font-league-spartan"
cask "font-libertinus"
cask "font-libre-caslon-text"
cask "font-libre-franklin"
cask "font-luculent"
cask "font-monoid"
cask "font-monoisome"
cask "font-mononoki"
cask "font-mplus"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-overpass"
cask "font-pecita"
cask "font-raleway"
cask "font-recursive"
cask "font-recursive-code"
cask "font-roboto-slab"
cask "font-rounded-mplus"
cask "font-signika"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-space-mono"
cask "font-tt2020"
cask "font-victor-mono"
cask "font-voces"
cask "font-vollkorn"
cask "font-voltaire"

cask "fsnotes"
cask "gitter"
cask "gitup"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "hazel"
cask "hex-fiend"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "jami"
cask "jitsi"
cask "kap"
cask "keepassxc"
cask "keybase"
cask "keycastr"
cask "kindle-previewer"
cask "koa11y"
cask "lektor"
cask "linphone"
cask "macdown"
cask "macvim"
cask "mark-text"
cask "meld"
cask "metabase"
cask "mic-drop"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "min"
cask "mjml"
cask "monodraw"
cask "moom"
cask "ngrok"
cask "notion"
cask "opera-developer"
cask "powershell"
cask "resolutionator"
cask "responsively"
cask "safari-technology-preview"
cask "scummvm"
cask "setapp"
cask "shortcutdetective"
cask "sketch"
cask "slack"
cask "swiftpm-catalog"
cask "tableflip"
cask "tad"
cask "time-sink"
cask "tla-plus-toolbox"
cask "topnotch"
cask "trex"
cask "tuple"
cask "utm"
cask "viscosity"
cask "visual-studio-code"
cask "vitals"
cask "vivaldi"
cask "xcodes"
cask "zeplin"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Abyss", id: 1507396839
mas "Acorn", id: 1547371478
mas "Byword", id: 420212497
mas "Calca", id: 635758264
mas "CARROT Weather", id: 993487541
mas "DaisyDisk", id: 411643860
mas "GarageBand", id: 682658836
mas "Grocery", id: 1195676848
mas "Icon Slate", id: 439697913
mas "Image2icon", id: 992115977
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Mactracker", id: 430255202
mas "Mimeo Photos", id: 1282504627
mas "Motif", id: 1404636482
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Parcel", id: 639968404
mas "Patterns", id: 429449079
mas "PCalc", id: 403504866
mas "Pinboard Tools", id: 1552590875
mas "PiPifier", id: 1160374471
mas "Pixelmator Pro", id: 1289583905
mas "PopClip", id: 445189367
mas "rcmd", id: 1596283165
mas "Screens", id: 446107677
mas "SnippetsLab", id: 1006087419
mas "Super Agent", id: 1568262835
mas "Svgsus", id: 1106867065
mas "System Strings", id: 570467776
mas "Tasks", id: 1502903102
mas "Typeface", id: 1062679359
mas "Vinegar", id: 1591303229
mas "VoodooPad", id: 514489722
mas "xScope", id: 889428659
