tap "adoptopenjdk/openjdk"
tap "apparition47/tap"
tap "d12frosted/emacs-plus"
tap "domt4/autoupdate"
tap "dteoh/sqa"
tap "github/gh"
tap "halostatue/pgtap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mkw/mkw"
tap "muesli/tap"
tap "orf/brew"
tap "petere/postgresql"
tap "puma/puma"
tap "sqitchers/sqitch"
brew "adr-tools"
brew "ansifilter"
brew "aspell"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "bats-core"
brew "openssl@1.1"
brew "bison"
brew "gdbm"
brew "gettext"
brew "libffi"
brew "pcre"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.9"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "chezmoi"
brew "chruby"
brew "pcre2"
brew "fish"
brew "chruby-fish"
brew "cloc"
brew "cmake"
brew "codespell"
brew "cpanminus"
brew "ctags"
brew "diff-so-fancy"
brew "direnv"
brew "dog"
brew "dos2unix"
brew "epubcheck"
brew "fping"
brew "fribidi"
brew "fzf"
brew "fzy"
brew "gawk"
brew "gd"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "gobject-introspection"
brew "jasper"
brew "librsvg"
brew "graphviz"
brew "hadolint"
brew "htop"
brew "hub"
brew "imageoptim-cli"
brew "jemalloc"
brew "jq"
brew "kerl"
brew "libgit2"
brew "libidn2"
brew "libpq"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "lnav"
brew "mas"
brew "miller"
brew "monolith"
brew "moreutils"
brew "msgpack"
brew "neovim"
brew "nim"
brew "node"
brew "packer"
brew "perl"
brew "pgcli"
brew "picat"
brew "pipx"
brew "postgresql@9.6", restart_service: true, link: true
brew "pv"
brew "ruby-build"
brew "ruby-install"
brew "shellcheck"
brew "shfmt"
brew "swift-format"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "swiftplate"
brew "terminal-notifier"
brew "terraform"
brew "textql"
brew "the_silver_searcher"
brew "tig"
brew "tnef"
brew "tree"
brew "wget"
brew "yarn"
brew "yq"
brew "zig"
brew "zola"
brew "heroku/brew/heroku"
brew "sqitchers/sqitch/sqitch", args: ["with-postgres-support", "with-sqlite-support", "without-postgresql"]
cask "1password-cli"
cask "adoptopenjdk13"
cask "alacritty"
cask "alfred"
cask "anydesk"
cask "autodmg"
cask "azure-data-studio"
cask "bitbar"
cask "browserosaurus"
cask "calibre"
cask "charles"
cask "deepl"
cask "desktop-curtain"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "finicky"
cask "firefox"
cask "fluid"
cask "font-abel"
cask "font-advent-pro"
cask "font-aileron"
cask "font-alegreya"
cask "font-alegreya-sans"
cask "font-alice"
cask "font-andada"
cask "font-andada-sc"
cask "font-anonymous-pro"
cask "font-antic"
cask "font-antic-didone"
cask "font-antic-slab"
cask "font-arapey"
cask "font-average"
cask "font-average-sans"
cask "font-balthazar"
cask "font-bebas-neue"
cask "font-bitstream-vera"
cask "font-bitter"
cask "font-blokk-neue"
cask "font-cascadia"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-cascadia-pl"
cask "font-chapbook"
cask "font-clear-sans"
cask "font-comic-neue"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-medium-and-semi-bold"
cask "font-courier-prime-sans"
cask "font-crimson-text"
cask "font-della-respira"
cask "font-eb-garamond"
cask "font-et-book"
cask "font-exo2"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-gentium-basic"
cask "font-gentium-book-basic"
cask "font-gentium-plus"
cask "font-go"
cask "font-go-medium"
cask "font-go-mono"
cask "font-goudy-bookletter1911"
cask "font-hack"
cask "font-hasklig"
cask "font-hermit"
cask "font-ibm-plex"
cask "font-inconsolata"
cask "font-input"
cask "font-iosevka"
cask "font-jaapokki"
cask "font-jetbrains-mono"
cask "font-josefin-sans"
cask "font-josefin-slab"
cask "font-juliamono"
cask "font-lato"
cask "font-league-gothic"
cask "font-league-spartan"
cask "font-libertinus"
cask "font-libre-baskerville"
cask "font-libre-caslon-text"
cask "font-libre-franklin"
cask "font-luculent"
cask "font-monoid"
cask "font-monoisome"
cask "font-mononoki"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-overpass"
cask "font-pecita"
cask "font-raleway"
cask "font-recursive"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-signika"
cask "font-sorts-mill-goudy"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-space-mono"
cask "font-tt2020"
cask "font-ubuntu"
cask "font-victor-mono"
cask "font-voces"
cask "font-vollkorn"
cask "font-voltaire"
cask "fork"
cask "gitter"
cask "gitup"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "hazel"
cask "hex-fiend"
cask "imageoptim"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "jami"
cask "jitsi"
cask "kap"
cask "keepassxc"
cask "keybase"
cask "keycastr"
cask "kindle-previewer"
cask "kindlegen"
cask "kitty"
cask "koa11y"
cask "lektor"
cask "linphone"
cask "macvim"
cask "mailtrackerblocker"
cask "meld"
cask "microsoft-edge"
cask "min"
cask "mjml"
cask "monodraw"
cask "moom"
cask "ngrok"
cask "opera-developer"
cask "optimage"
cask "powershell"
cask "racket"
cask "resolutionator"
cask "responsively"
cask "safari-technology-preview"
cask "scummvm"
cask "setapp"
cask "slack"
cask "swiftpm-catalog"
cask "tableflip"
cask "time-sink"
cask "tla-plus-toolbox"
cask "tuple"
cask "vagrant"
cask "vimr"
cask "virtualbox"
cask "viscosity"
cask "visual-studio-code"
cask "vivaldi"
cask "zeplin"
mas "1Password 7", id: 1333542190
mas "2Do", id: 477670270
mas "Abyss", id: 1507396839
mas "Acorn", id: 1547371478
mas "Better", id: 1121192229
mas "Byword", id: 420212497
mas "Calca", id: 635758264
mas "com.pixelmatorteam.pixelmator.x", id: 1289583905
mas "Controlly", id: 1548544614
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
mas "friedmann print", id: 1482660936
mas "Hush", id: 1544743900
mas "Icon Slate", id: 439697913
mas "Image2icon", id: 992115977
mas "iMazing HEIC Converter", id: 1292198261
mas "InspectPNG", id: 498851708
mas "Kaleidoscope", id: 587512244
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Liquid", id: 569048352
mas "Mactracker", id: 430255202
mas "MILK Books", id: 1486465681
mas "Mimeo Photos", id: 1282504627
mas "Motif", id: 1404636482
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Parcel", id: 639968404
mas "Patterns", id: 429449079
mas "PCalc", id: 403504866
mas "Pinboard Tools", id: 1552590875
mas "PiPifier", id: 1160374471
mas "PopClip", id: 445189367
mas "ReadKit", id: 588726889
mas "Screens", id: 446107677
mas "SnippetsLab", id: 1006087419
mas "Svgsus", id: 1106867065
mas "System Strings", id: 570467776
mas "Table Tool", id: 1122008420
mas "Textual IRC Client", id: 896450579
mas "Tot", id: 1491071483
mas "Tweetbot", id: 557168941
mas "Typeface", id: 1062679359
mas "VoodooPad", id: 514489722
mas "xScope", id: 889428659
