{{- $personal := eq (get . "role") "personal" -}}
{{- $work := eq (get . "role") "work" -}}

{{ if $work -}}
tap "browsers-software/tap"
{{ end -}}
tap "homebrew/bundle"
tap "homebrew/services"
tap "reviewdog/tap"

brew "bomber" # Scans Software Bill of Materials for security vulnerabilities
brew "cliam" # Cloud agnostic IAM permissions enumerator
brew "cloc" # Statistics utility to count lines of code
brew "comby" # Tool for changing code across many languages
brew "csvtk" # Cross-platform, efficient and practical CSV/TSV toolkit in Golang
brew "docker-slim" # Minify and secure Docker images
brew "flarectl" # CLI application for interacting with a Cloudflare account
brew "gitbatch" # Manage your git repositories in one place
brew "mas" # Mac App Store command-line interface
brew "pam-reattach" # PAM module for reattaching to the user's GUI (Aqua) session
brew "reviewdog/tap/reviewdog" # Automated code review tool integrated with any code analysis tools regardless of programming language.
brew "syft" # CLI for generating a Software Bill of Materials from container images
brew "terracognita" # Reads from existing Cloud Providers and generates Terraform code
brew "tflint" # Linter for Terraform files
brew "tz" # CLI time zone visualizer

{{ if $personal -}}
cask "alfred" # Application launcher and productivity software
cask "anki" # Memory training application
cask "anydesk" # Allows connection to a computer remotely
cask "bbedit" # Text, code, and markup editor
{{ end -}}
{{ if $work -}}
cask "browserosaurus" # Open-source browser prompter
cask "browsers" # Open the right browser at the right time
{{ end -}}
cask "bruno" # Opensource IDE for exploring and testing api's
cask "charles" # Web debugging Proxy application
cask "cleanupbuddy" # Clean keyboard and trackpad
{{ if $personal -}}
cask "cog" # Audio player
cask "contour" # Terminal emulator
cask "deskpad" # Virtual monitor for screen sharing
cask "dosbox" # Emulator for x86 with DOS
cask "dosbox-x" # Fork of the DOSBox project
cask "eaglefiler" # Organise files, archive e-mails, save Web pages and notes, search everything
{{ end -}}
{{ if $work -}}
cask "drovio" # Remote pair programming and team collaboration tool
{{ end -}}
cask "finicky" # Utility for customizing which browser to start
cask "firefox" # Web browser
{{ if $personal -}}
cask "fluid" # Tool to turn a website into a desktop app
cask "gargoyle" # IO layer for interactive fiction players
{{ end -}}
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "google-chrome" # Web browser
{{ if $personal -}}
cask "hazel" # Automated organisation
{{ end -}}
{{ if $work -}}
cask "headlamp" # UI for Kubernetes
{{ end -}}
cask "hex-fiend" # Hex editor focussing on speed
cask "httpie" # Testing client for REST, GraphQL, and HTTP APIs
{{ if $personal -}}
cask "iina" # Free and open-source media player
{{ end -}}
cask "imhex" # Hex editor for reverse engineers
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
cask "itsycal" # Menu bar calendar
{{ if $personal -}}
cask "jan" # Offline AI chat tool
{{ end -}}
{{ if $work -}}
cask "jordanbaird-ice" # Menu bar manager
{{ end -}}
{{ if $personal -}}
cask "kindle-previewer" # Preview and audit Kindle eBooks
cask "koodo-reader" # Open-source epub reader
{{ end -}}
cask "livebook" # Code notebooks for Elixir developers
{{ if $personal -}}
cask "lm-studio" # Discover, download, and run local LLMs
{{ end -}}
{{ if $work -}}
cask "loop" # Window manager
cask "maccy" # Clipboard manager
{{ end -}}
cask "macvim" # Text editor
{{ if $personal -}}
cask "macwhisper" # Speech recognition tool
{{ end -}}
cask "meetingbar" # Shows the next meeting in the menu bar
cask "microsoft-edge" # Multi-platform web browser
{{ if $personal -}}
cask "monitorcontrol" # Tool to control external monitor brightness & volume
cask "monodraw" # Tool to create text-based art
cask "moom" # Utility to move and zoom windows—on one display
cask "msty" # Run LLMs locally
{{ end -}}
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files
{{ if $personal -}}
cask "ollamac" # Interact with Ollama models
{{ end -}}
{{ if $work -}}
cask "openlens" # Open source build of Lens Kubernetes IDE
{{ end -}}
cask "orion" # WebKit based web browser
{{ if $personal -}}
cask "pieces" # Code snippets, screenshots and workflow context
cask "pieces-os" # Local datastore, server, and ML engine powering the Pieces for Developers Suite
{{ end -}}
{{ if $work -}}
cask "postgres-unofficial" # App wrapper for Postgres
cask "postman" # Collaboration platform for API development
{{ end -}}
cask "qlcolorcode" # Quick Look plug-in that renders source code with syntax highlighting
cask "qlmarkdown" # Quick Look generator for Markdown files
cask "qlstephen" # Quick Look plugin for plaintext files without an extension
cask "qlvideo" # Thumbnails, static previews, cover art and metadata for video files
cask "quicklook-json" # Quick Look plugin for JSON files
{{ if $work -}}
cask "quicksilver" # Productivity application
{{ end -}}
{{ if $personal -}}
cask "resolutionator" # Use any of your display's available resolutions
{{ end -}}
cask "safari-technology-preview" # Web browser
{{ if $personal -}}
cask "scrivener" # Word processing software with a typewriter style
cask "setapp" # Collection of apps available by subscription
{{ end -}}
{{ if $work -}}
cask "slack" # Team communication and collaboration software
{{ end -}}
{{ if $personal -}}
cask "spatterlight" # Play most kinds of interactive fiction game files
cask "tableflip" # Edit plain text tables in place: Markdown, CSV, JSON. LaTeX and HTML export
{{ end -}}
{{ if $work -}}
cask "trex" # Easy to use text extraction tool
{{ end -}}
{{ if $personal -}}
cask "viscosity" # OpenVPN client with AppleScript support
{{ end -}}
cask "visual-studio-code" # Open-source code editor
cask "webpquicklook" # Quick Look plugin for webp files
{{ if false -}}
cask "xcodes" # Install and switch between multiple versions of Xcode
{{ end -}}
cask "xprocheck" # Anti-malware scan logging tool
cask "zed" # Multiplayer code editor

## Fonts
# This cask is currently broken.
# cask "font-0xproto"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-eb-garamond"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-hack"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-maple-mono"
cask "font-monaspace"
cask "font-sf-mono"
cask "font-source-code-pro"
cask "font-space-mono"

{{ if $personal -}}
mas "1Blocker", id: 1365531024
{{ end -}}
mas "1Password for Safari", id: 1569813296
{{ if $work -}}
mas "AdGuard for Safari", id: 1440147259
{{ end -}}
{{ if $personal -}}
mas "Actions", id: 1586435171
mas "Baking Soda", id: 1601151613
mas "Balatro+", id: 6502451661
mas "Byword", id: 420212497
mas "CARROT Weather", id: 993487541
mas "Calca", id: 635758264
mas "Codelime", id: 1622145140
mas "Craft", id: 1487937127
mas "Data Jar", id: 1453273600
mas "Developer", id: 640199958
mas "Esse", id: 1438921989
mas "Exporter", id: 1099120373
mas "Flighty", id: 1358823008
mas "GRIS+", id: 1617349089
{{ end -}}
mas "GarageBand", id: 682658836
{{ if $personal -}}
mas "GoodLinks", id: 1474335294
mas "Grim Fandango", id: 1022841309
mas "Grocery", id: 1195676848
mas "Hand Mirror", id: 1502839586
mas "History Book", id: 1619241039
mas "Hush", id: 1544743900
mas "Ice Cubes", id: 6444915884
mas "Icon Slate", id: 439697913
mas "Image2icon", id: 992115977
{{ end -}}
mas "Keynote", id: 409183694
{{ if $personal -}}
mas "Kindle", id: 302584613
mas "Kingdoms: Merge & Build", id: 1636872154
mas "Later", id: 1507396839
mas "Mactracker", id: 430255202
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "MenubarX", id: 1575588022
mas "Mimeo Photos", id: 1282504627
mas "Muse", id: 1501563902
mas "MusicBox", id: 1614730313
{{ end -}}
mas "Numbers", id: 409203825
{{ if $personal -}}
mas "PCalc", id: 403504866
{{ end -}}
mas "Pages", id: 409201541
{{ if $personal -}}
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PiPifier", id: 1160374471
mas "Pixelmator Pro", id: 1289583905
mas "Play", id: 1596506190
mas "Ridiculous Fishing", id: 1610164691
mas "Shareful", id: 1522267256
mas "StopTheMadness Pro", id: 6471380298
mas "Svgsus", id: 1106867065
mas "TestFlight", id: 899247664
mas "Tokenary", id: 1375542355
mas "Userscripts-Mac-App", id: 1463298887
mas "Vinegar", id: 1591303229
mas "Waterlogue Pro", id: 1425568219
{{ end -}}
{{- if $work}}
mas "WireGuard", id: 1451685025
{{ end -}}
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
{{ if $personal -}}
mas "junkworld", id: 6448185316
mas "xScope", id: 889428659
{{ end -}}
{{/* Things to consider
brew "common-fate/granted/granted"
brew "turbot/tap/flowpipe" # not in ports
brew "turbot/tap/powerpipe" # not in ports
brew "turbot/tap/steampipe" # also in ports
*/}}
