{{- $personal := eq (get . "role") "personal" -}}
{{- $work := eq (get . "role") "work" -}}

tap "browsers-software/tap"
tap "homebrew/bundle"
tap "homebrew/services"

brew "bomber" # Scans Software Bill of Materials for security vulnerabilities
brew "csvtk" # Cross-platform, efficient and practical CSV/TSV toolkit in Golang
brew "flarectl" # CLI application for interacting with a Cloudflare account
brew "syft" # CLI for generating a Software Bill of Materials from container images

{{ if $personal -}}
cask "acorn" # Image editor focused on simplicity
cask "affinity-designer" # Professional graphic design software
cask "affinity-photo" # Professional image editing software
cask "affinity-publisher" # Professional desktop publishing software
cask "alfred" # Application launcher and productivity software
cask "anki" # Memory training application
cask "anydesk" # Allows connection to a computer remotely
cask "bbedit" # Text, code, and markup editor
{{- end }}
cask "browsers" # Open the right browser at the right time
cask "cleanupbuddy" # Clean keyboard and trackpad
{{ if $work -}}
cask "dehesselle-meld" # Visual diff and merge tool
{{- end }}
{{ if $personal -}}
cask "dosbox" # Emulator for x86 with DOS
cask "dosbox-x" # Fork of the DOSBox project
{{- end }}
{{ if $work -}}
cask "drovio" # Remote pair programming and team collaboration tool
{{- end }}
{{ if $personal -}}
cask "eaglefiler" # Organise files, archive e-mails, save Web pages and notes, search everything
{{- end }}
cask "finicky" # Utility for customizing which browser to start
cask "firefox" # Web browser
{{ if $personal -}}
cask "fluid" # Tool to turn a website into a desktop app
cask "gargoyle" # IO layer for interactive fiction players
{{- end }}
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "google-chrome" # Web browser
{{ if $personal -}}
cask "hazel" # Automated organisation
{{- end }}
{{ if $work -}}
cask "headlamp" # UI for Kubernetes
{{- end }}
cask "hex-fiend" # Hex editor focussing on speed
cask "imhex" # Hex editor for reverse engineers
cask "itsycal" # Menu bar calendar
{{ if $work -}}
cask "jordanbaird-ice" # Menu bar manager
{{- end }}
{{ if $personal -}}
cask "kindle-previewer" # Preview and audit Kindle eBooks
cask "koodo-reader" # Open-source epub reader
{{- end }}
cask "leader-key" # Application launcher
cask "livebook" # Code notebooks for Elixir developers
{{ if $work -}}
cask "loop" # Window manager
cask "maccy" # Clipboard manager
{{- end }}
cask "macvim" # Text editor
{{ if $personal -}}
cask "macwhisper" # Speech recognition tool
{{- end }}
cask "meetingbar" # Shows the next meeting in the menu bar
cask "microsoft-edge" # Multi-platform web browser
{{ if $personal -}}
cask "monitorcontrol" # Tool to control external monitor brightness & volume
cask "monodraw" # Tool to create text-based art
cask "moom" # Utility to move and zoom windows—on one display
{{- end }}
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files
{{ if $work -}}
cask "openlens" # Open source build of Lens Kubernetes IDE
{{- end }}
cask "orion" # WebKit based web browser
cask "postgres-unofficial" # App wrapper for Postgres
{{ if $work -}}
cask "postman" # Collaboration platform for API development
{{- end }}
cask "qlcolorcode" # Quick Look plug-in that renders source code with syntax highlighting
cask "qlmarkdown" # Quick Look generator for Markdown files
cask "qlstephen" # Quick Look plugin for plaintext files without an extension
cask "qlvideo" # Thumbnails, static previews, cover art and metadata for video files
cask "quicklook-json" # Quick Look plugin for JSON files
{{ if $work -}}
cask "quicksilver" # Productivity application
{{- end }}
cask "raycast" # Control your tools with a few keystrokes
{{ if $personal -}}
cask "resolutionator" # Use any of your display's available resolutions
{{- end }}
cask "safari-technology-preview" # Web browser
{{ if $personal -}}
cask "scrivener" # Word processing software with a typewriter style
cask "setapp" # Collection of apps available by subscription
{{- end }}
{{ if $work -}}
cask "slack" # Team communication and collaboration software
{{- end }}
{{ if $personal -}}
cask "spatterlight" # Play most kinds of interactive fiction game files
{{- end }}
# cask "startupfolder" # Run anything at startup by simply placing it in a special folder
cask "trex" # Easy to use text extraction tool
cask "visual-studio-code" # Open-source code editor
cask "webpquicklook" # Quick Look plugin for webp files
cask "xprocheck" # Anti-malware scan logging tool
cask "zed" # Multiplayer code editor

## Fonts
cask "font-0xproto"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-eb-garamond"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-hack"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex-mono"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-maple-mono"
cask "font-monaspace"
cask "font-sf-mono"
cask "font-source-code-pro"
cask "font-space-mono"
cask "font-zed-mono"

mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
{{ if $personal -}}
mas "Actions", id: 1586435171
mas "Baking Soda", id: 1601151613
mas "Big Wallet", id: 6478607925
mas "Byword", id: 420212497
mas "CARROT Weather", id: 993487541
mas "Calca", id: 635758264
mas "Codelime", id: 1622145140
mas "Developer", id: 640199958
mas "Flighty", id: 1358823008
mas "GRIS+", id: 1617349089
{{- end }}
{{ if $personal -}}
mas "GoodLinks", id: 1474335294
mas "Grim Fandango", id: 1022841309
mas "Hand Mirror", id: 1502839586
mas "History Book", id: 1619241039
mas "Hush", id: 1544743900
mas "Ice Cubes", id: 6444915884
mas "Icon Slate", id: 439697913
mas "Image2icon", id: 992115977
mas "Kindle", id: 302584613
mas "Kingdoms: Merge & Build", id: 1636872154
mas "Later", id: 1507396839
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "MenubarX", id: 1575588022
mas "PCalc", id: 403504866
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PiPifier", id: 1160374471
mas "Pixelmator Pro", id: 1289583905
mas "Ridiculous Fishing", id: 1610164691
mas "Shareful", id: 1522267256
{{- end }}
mas "Sim Daltonism", id: 693112260
{{ if $personal -}}
mas "StopTheMadness Pro", id: 6471380298
mas "Svgsus", id: 1106867065
mas "TestFlight", id: 899247664
mas "Vinegar", id: 1591303229
{{- end }}
{{- if $work}}
mas "WireGuard", id: 1451685025
{{- end }}
mas "Xcode", id: 497799835
{{ if $personal -}}
mas "junkworld", id: 6448185316
mas "xScope", id: 889428659
{{- end }}
{{- /* Things to consider
brew "common-fate/granted/granted"
brew "turbot/tap/flowpipe" # not in ports
brew "turbot/tap/powerpipe" # not in ports
brew "turbot/tap/steampipe" # also in ports
*/ -}}
