tap "commitdev/zero"
tap "heroku/brew"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "schappim/ocr"
tap "superfly/tap"
tap "tilt-dev/tap"
tap "turbot/tap"

# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Email client that runs in your terminal
brew "aerc"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Spell checker with better logic than ispell
brew "aspell"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Bash Automated Testing System
brew "bats-core"
# Insanely fast image printing in your terminal
brew "catimg"
# CloudFlare's PKI toolkit
brew "cfssl"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Thin wrapper around chruby to make it work with the Fish shell
brew "chruby-fish"
# Statistics utility to count lines of code
brew "cloc"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Tool for changing code across many languages
brew "comby"
# Allow startup developers to ship to production on day 1.
brew "commitdev/zero/zero"
# Container Signing
brew "cosign"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Cross-platform, efficient and practical CSV/TSV toolkit in Golang
brew "csvtk"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# In-depth comparison of files, archives, and directories
brew "diffoscope"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Minify and secure Docker images
brew "docker-slim"
# TUI Client for Docker
brew "docui"
# Command-line DNS client
brew "dog"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Run arbitrary commands when files change
brew "entr"
# Validate EPUB files, version 2.0 and later
brew "epubcheck"
# Efficient Duplicate File Finder
brew "fclones"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# CLI application for interacting with a Cloudflare account
brew "flarectl"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Manage your git repositories in one place
brew "gitbatch"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Pure Go implementation of jq
brew "gojq"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Cost estimates for Terraform
brew "infracost"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Easy building and installing of Erlang/OTP instances
brew "kerl"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# International domain name library (IDNA2008, Punycode and TR46)
brew "lnav"
# Fully functional local AWS cloud stack
brew "localstack"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Statically typed compiled systems programming language
brew "nim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# A tool to manage rack apps in development with puma
brew "puma/puma/puma-dev"
# Monitor data's progress through a pipe
brew "pv"
# Encoder and decoder for quoted-printable encoding
brew "qprint"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Get any text on your screen into your clipboard.
brew "schappim/ocr/ocr"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
brew "superfly/tap/flyctl"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Reads from existing Cloud Providers and generates Terraform code
brew "terracognita"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Making local Kubernetes clusters easy to set up and tear down
brew "tilt-dev/tap/ctlptl"
# A dev environment as code for microservice apps
brew "tilt-dev/tap/tilt"
# Instant terminal sharing
brew "tmate"
# Microsoft MS-TNEF attachment unpacker
brew "tnef"
# Steampipe exposes APIs and services as a high-performance relational database, giving you the ability to write SQL-based queries to explore, assess and report on dynamic data.
brew "turbot/tap/steampipe"
# CLI time zone visualizer
brew "tz"
# Maintained ctags implementation
brew "universal-ctags"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Linter for YAML files
brew "yamllint"
# Process YAML documents from the CLI
brew "yq"

# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Allows connection to a computer remotely
cask "anydesk"
# Text, code, and markup editor
cask "bbedit"
# E-books management software
cask "calibre"
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# Web debugging Proxy application
cask "charles"
# Organize files, archive e-mails, save Web pages and notes, search everything
cask "eaglefiler"
# Reimagine your terminal
cask "fig"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Tool to turn a website into a desktop app
cask "fluid"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-medium-and-semi-bold"
cask "font-courier-prime-sans"
# Garamond typeface based on the 1592 Berner specimen
cask "font-eb-garamond"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hack"
cask "font-hack-nerd-font"
# Code font with monospaced ligatures
cask "font-hasklig"
cask "font-ibm-plex"
cask "font-inconsolata"
cask "font-input"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Monospaced typeface designed for programming in Julia
cask "font-juliamono"
cask "font-mononoki"
# Iconic font collection with 3,600+ icons. Glyph collections: Font Awesome, Material Design Icons, Octicons, & more. Symbols only version.
cask "font-nerd-symbols-only"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Automated organization
cask "hazel"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Open-source keystroke visualizer
cask "keycastr"
# Preview and audit Kindle eBooks
cask "kindle-previewer"
# Easily check for website accessibility issues
cask "koa11y"
# Text editor
cask "macvim"
# Quickly mute your microphone with a global shortcut or menu bar control
cask "mic-drop"
# Web browser
cask "microsoft-edge"
# CSV editor
cask "modern-csv"
# Tool to create text-based art
cask "monodraw"
# Utility to move and zoom windows—on one display
cask "moom"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Web browser
cask "opera-developer"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Kubernetes and container management on the desktop
cask "rancher"
# Use any of your display's available resolutions
cask "resolutionator"
# Modified browser that helps in responsive web development
cask "responsively"
# Open source virtual/remote desktop application
cask "rustdesk"
# Web browser
cask "safari-technology-preview"
# Word processing software with a typewriter style
cask "scrivener"
# Collection of apps available by subscription
cask "setapp"
# Digital design and prototyping platform
cask "sketch"
# Team communication and collaboration software
cask "slack"
# App to edit markdown files in place
cask "tableflip"
# Desktop application for viewing and analyzing tabular data
cask "tad"
# Remote pair programming app
cask "tuple"
# Virtual machines UI using QEMU
cask "utm"
# GUI for the Neovim text editor
cask "vimr"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Web browser focusing on customization and control
cask "vivaldi"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Share, organize and collaborate on designs
cask "zeplin"

mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Abyss", id: 1507396839
mas "Acorn", id: 1547371478
mas "Actions", id: 1586435171
mas "Byword", id: 420212497
mas "Calca", id: 635758264
mas "CARROT Weather", id: 993487541
mas "Craft", id: 1487937127
mas "Data Jar", id: 1453273600
mas "Deliveries", id: 290986013
mas "Developer", id: 640199958
mas "Esse", id: 1438921989
mas "Exporter", id: 1099120373
mas "GarageBand", id: 682658836
mas "Grim Fandango", id: 1022841309
mas "Grocery", id: 1195676848
mas "Icon Slate", id: 439697913
mas "Image2icon", id: 992115977
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Mactracker", id: 430255202
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "MenubarX", id: 1575588022
mas "Mimeo Photos", id: 1282504627
mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Parcel", id: 639968404
mas "PCalc", id: 403504866
mas "Pinboard Tools", id: 1552590875
mas "PiPifier", id: 1160374471
mas "Pixelmator Pro", id: 1289583905
mas "PopClip", id: 445189367
mas "Shareful", id: 1522267256
mas "Svgsus", id: 1106867065
mas "System Strings", id: 570467776
mas "Tasks", id: 1502903102
mas "TestFlight", id: 899247664
mas "Typeface", id: 1062679359
mas "Vinegar", id: 1591303229
mas "xScope", id: 889428659
mas "Zen Pinball Party", id: 1536783591
