tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "reviewdog/tap"

brew "bomber" # Scans Software Bill of Materials for security vulnerabilities
brew "cliam" # Cloud agnostic IAM permissions enumerator
brew "cloc" # Statistics utility to count lines of code
brew "comby" # Tool for changing code across many languages
brew "csvtk" # Cross-platform, efficient and practical CSV/TSV toolkit in Golang
brew "datasette" # Open source multi-tool for exploring and publishing data
brew "docker-slim" # Minify and secure Docker images
brew "epubcheck" # Validate EPUB files, version 2.0 and later
brew "fclones" # Efficient Duplicate File Finder
brew "flarectl" # CLI application for interacting with a Cloudflare account
brew "fping" # Scriptable ping program for checking if multiple hosts are up
brew "fzy" # Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "git" # Distributed revision control system
brew "git-bug" # Distributed, offline-first bug tracker embedded in git, with bridges
brew "gitbatch" # Manage your git repositories in one place
brew "gitleaks" # Audit git repos for secrets
brew "lnav" # Curses-based tool for viewing and analyzing log files
brew "mas" # Mac App Store command-line interface
brew "moreutils" # Collection of tools that nobody wrote when UNIX was young
brew "neovide" # No Nonsense Neovim Client in Rust
brew "pam-reattach" # PAM module for reattaching to the user's GUI (Aqua) session
brew "pandoc" # Swiss-army knife of markup format conversion
brew "pv" # Monitor data's progress through a pipe
brew "reviewdog/tap/reviewdog" # Automated code review tool integrated with any code analysis tools regardless of programming language.
brew "scc" # Fast and accurate code counter with complexity and COCOMO estimates
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt" # Autoformat shell script source code
brew "syft" # CLI for generating a Software Bill of Materials from container images
brew "tectonic" # Modernized, complete, self-contained TeX/LaTeX engine
brew "terminal-notifier" # Send macOS User Notifications from the command-line
brew "terracognita" # Reads from existing Cloud Providers and generates Terraform code
brew "terraform-docs" # Tool to generate documentation from Terraform modules
brew "terraformer" # CLI tool to generate terraform files from existing infrastructure
brew "tflint" # Linter for Terraform files
brew "tfsec" # Static analysis security scanner for your terraform code
brew "the_silver_searcher" # Code-search similar to ack
brew "trivy" # Vulnerability scanner for container images, file systems, and Git repos
brew "tz" # CLI time zone visualizer
brew "universal-ctags" # Maintained ctags implementation
brew "watch" # Executes a program periodically, showing output fullscreen
brew "watchexec" # Execute commands when watched files change
brew "wget" # Internet file retriever
brew "xdg-ninja" # Check your $HOME for unwanted files and directories
brew "xmlstarlet" # XML command-line utilities
brew "xq" # Command-line XML and HTML beautifier and content extractor
brew "yq" # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "zsxd" # Zelda Mystery of Solarus XD

cask "alacritty" # GPU-accelerated terminal emulator
cask "alfred" # Application launcher and productivity software
cask "anki" # Memory training application
cask "anydesk" # Allows connection to a computer remotely
cask "bbedit" # Text, code, and markup editor
cask "bruno" # Opensource IDE for exploring and testing api's
cask "charles" # Web debugging Proxy application
cask "cleanupbuddy" # Clean keyboard and trackpad
cask "dosbox" # Emulator for x86 with DOS
cask "eaglefiler" # Organise files, archive e-mails, save Web pages and notes, search everything
cask "finicky" # Utility for customizing which browser to start
cask "firefox" # Web browser
cask "fluid" # Tool to turn a website into a desktop app
cask "gargoyle" # IO layer for interactive fiction players
cask "google-chrome" # Web browser
cask "gpg-suite-no-mail" # Tools to protect your files
cask "hazel" # Automated organisation
cask "hex-fiend" # Hex editor focussing on speed
cask "httpie" # Testing client for REST, GraphQL, and HTTP APIs
cask "insomnia" # HTTP and GraphQL Client
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
cask "itsycal" # Menu bar calendar
cask "kindle-previewer" # Preview and audit Kindle eBooks
cask "maccy" # Clipboard manager
cask "macvim" # Text editor
cask "macwhisper" # Speech recognition tool
cask "meetingbar" # Shows the next meeting in the menu bar
cask "microsoft-edge" # Web browser
cask "monitorcontrol" # Tool to control external monitor brightness & volume
cask "monodraw" # Tool to create text-based art
cask "moom" # Utility to move and zoom windows—on one display
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files
cask "ollamac" # Interact with Ollama models
cask "orion" # WebKit based web browser
cask "publii" # Static website generator
cask "qlcolorcode" # Quick Look plug-in that renders source code with syntax highlighting
cask "qlimagesize" # Display image info and preview unsupported formats in QuickLook
cask "qlmarkdown" # Quick Look generator for Markdown files
cask "qlstephen" # Quick Look plugin for plaintext files without an extension
cask "qlvideo" # Thumbnails, static previews, cover art and metadata for video files
cask "quicklook-json" # Quick Look plugin for JSON files
cask "resolutionator" # Use any of your display's available resolutions
cask "safari-technology-preview" # Web browser
cask "scrivener" # Word processing software with a typewriter style
cask "setapp" # Collection of apps available by subscription
cask "slack" # Team communication and collaboration software
cask "spatterlight" # Play most kinds of interactive fiction game files
cask "tableflip" # Edit plain text tables in place: Markdown, CSV, JSON. LaTeX and HTML export
cask "viscosity" # OpenVPN client with AppleScript support
cask "visual-studio-code" # Open-source code editor
cask "webpquicklook" # Quick Look plugin for webp files
cask "xcodes" # Install and switch between multiple versions of Xcode
cask "xprocheck" # Anti-malware scan logging tool
cask "zed" # Multiplayer code editor

## Fonts
cask "font-0xproto"
cask "font-b612-mono"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-charis-sil"
cask "font-commit-mono"
cask "font-cormorant-garamond"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-medium-and-semi-bold"
cask "font-courier-prime-sans"
cask "font-dm-mono"
cask "font-dm-sans"
cask "font-dm-serif-display"
cask "font-dm-serif-text"
cask "font-eb-garamond"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-geist-mono"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-input"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-monaspace"
cask "font-mononoki"
cask "font-pt-serif"
cask "font-recursive"
cask "font-recursive-code"
cask "font-source-code-pro"
cask "font-space-mono"
cask "font-symbols-only-nerd-font"

mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Acorn", id: 1547371478
mas "Actions", id: 1586435171
mas "Baking Soda", id: 1601151613
mas "Byword", id: 420212497
mas "CARROT Weather", id: 993487541
mas "Calca", id: 635758264
mas "Codelime", id: 1622145140
mas "Craft", id: 1487937127
mas "Data Jar", id: 1453273600
mas "Developer", id: 640199958
mas "Esse", id: 1438921989
mas "Exporter", id: 1099120373
mas "Flighty", id: 1358823008
mas "GRIS+", id: 1617349089
mas "GarageBand", id: 682658836
mas "GoodLinks", id: 1474335294
mas "Grim Fandango", id: 1022841309
mas "Grocery", id: 1195676848
mas "Hand Mirror", id: 1502839586
mas "History Book", id: 1619241039
mas "Hush", id: 1544743900
mas "Icon Slate", id: 439697913
mas "Image2icon", id: 992115977
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Kingdoms: Merge & Build", id: 1636872154
mas "Later", id: 1507396839
mas "Mactracker", id: 430255202
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "MenubarX", id: 1575588022
mas "Mimeo Photos", id: 1282504627
mas "Muse", id: 1501563902
mas "MusicBox", id: 1614730313
mas "Numbers", id: 409203825
mas "Omnivore", id: 1564031042
mas "PCalc", id: 403504866
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "PiPifier", id: 1160374471
mas "Pixelmator Pro", id: 1289583905
mas "Play", id: 1596506190
mas "Ridiculous Fishing", id: 1610164691
mas "Shareful", id: 1522267256
mas "StopTheMadness Pro", id: 6471380298
mas "Svgsus", id: 1106867065
mas "TestFlight", id: 899247664
mas "Userscripts-Mac-App", id: 1463298887
mas "Vinegar", id: 1591303229
mas "Waterlogue Pro", id: 1425568219
mas "WorldWideWeb", id: 1621370168
mas "iMovie", id: 408981434
mas "junkworld", id: 6448185316
mas "xScope", id: 889428659
