tap "commitdev/zero"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "puma/puma"
tap "schappim/ocr"
tap "superfly/tap"
tap "tilt-dev/tap"
tap "turbot/tap"

brew "act" # Run your GitHub Actions locally 🚀
brew "adr-tools" # CLI tool for working with Architecture Decision Records
brew "aerc" # Email client that runs in your terminal
brew "ansifilter" # Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "antiword" # Utility to read Word (.doc) files
brew "aria2" # Download with resuming and segmented downloading
brew "aspell" # Spell checker with better logic than ispell
brew "bash" # Bourne-Again SHell, a UNIX command interpreter
brew "ca-certificates" # Mozilla CA certificate store
brew "cabextract" # Extract files from Microsoft cabinet files
brew "catimg" # Insanely fast image printing in your terminal
brew "cfssl" # CloudFlare's PKI toolkit
brew "chafa" # Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chrome-cli" # Control Google Chrome from the command-line
brew "cloc" # Statistics utility to count lines of code
brew "comby" # Tool for changing code across many languages
brew "commitdev/zero/zero" # Allow startup developers to ship to production on day 1.
brew "csvtk" # Cross-platform, efficient and practical CSV/TSV toolkit in Golang
# brew "datasette" # Open source multi-tool for exploring and publishing data
brew "dhex" # Ncurses based advanced hex editor featuring diff mode and more
brew "diff-so-fancy" # Good-lookin' diffs with diff-highlight and more
brew "diffoscope" # In-depth comparison of files, archives, and directories
brew "direnv" # Load/unload environment variables based on $PWD
brew "dive" # Tool for exploring each layer in a docker image
brew "docker" # Pack, ship and run any application as a lightweight container
brew "docker-buildx" # Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-compose" # Isolated development environments using Docker
brew "docker-credential-helper" # Platform keystore credential helper for Docker
brew "docker-credential-helper-ecr" # Docker Credential Helper for Amazon ECR
brew "docker-slim" # Minify and secure Docker images
brew "dog" # Command-line DNS client
brew "dos2unix" # Convert text between DOS, UNIX, and Mac formats
brew "duf" # Disk Usage/Free Utility - a better 'df' alternative
brew "epubcheck" # Validate EPUB files, version 2.0 and later
brew "fclones" # Efficient Duplicate File Finder
brew "fish" # User-friendly command-line shell for UNIX-like operating systems
brew "flarectl" # CLI application for interacting with a Cloudflare account
brew "fping" # Scriptable ping program for checking if multiple hosts are up
brew "fzf" # Command-line fuzzy finder written in Go
brew "fzy" # Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "gawk" # GNU awk utility
brew "gettext" # GNU internationalization (i18n) and localization (l10n) library
brew "git" # Distributed revision control system
brew "git-bug" # Distributed, offline-first bug tracker embedded in git, with bridges
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "gitbatch" # Manage your git repositories in one place
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "jq" # Lightweight and flexible command-line JSON processor
brew "kerl" # Easy building and installing of Erlang/OTP instances
brew "lazydocker" # Lazier way to manage everything docker
brew "lazygit" # Simple terminal UI for git commands
brew "lnav" # International domain name library (IDNA2008, Punycode and TR46)
brew "localstack" # Fully functional local AWS cloud stack
brew "make" # Utility for directing compilation
brew "mas" # Mac App Store command-line interface
brew "moreutils" # Collection of tools that nobody wrote when UNIX was young
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "p7zip" # 7-Zip (high compression file archiver) implementation
brew "pam-reattach" # PAM module for reattaching to the user's GUI (Aqua) session
brew "pandoc" # Swiss-army knife of markup format conversion
brew "podman" # Tool for managing OCI containers and pods
brew "puma/puma/puma-dev" # A tool to manage rack apps in development with puma
brew "pv" # Monitor data's progress through a pipe
brew "qprint" # Encoder and decoder for quoted-printable encoding
brew "rename" # Perl-powered file rename script with many helpful built-ins
brew "scc" # Fast and accurate code counter with complexity and COCOMO estimates
brew "schappim/ocr/ocr" # Get any text on your screen into your clipboard.
brew "scummvm" # Graphic adventure game interpreter
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt" # Autoformat shell script source code
brew "superfly/tap/flyctl" # Command-line tools for fly.io services
brew "syft" # CLI for generating a Software Bill of Materials from container images
brew "tag" # Manipulate and query tags on macOS files
brew "tectonic" # Modernized, complete, self-contained TeX/LaTeX engine
brew "terminal-notifier" # Send macOS User Notifications from the command-line
brew "terracognita" # Reads from existing Cloud Providers and generates Terraform code
brew "terraform-docs" # Tool to generate documentation from Terraform modules
brew "terraformer" # CLI tool to generate terraform files from existing infrastructure
brew "tflint" # Linter for Terraform files
brew "tfsec" # Static analysis security scanner for your terraform code
brew "the_silver_searcher" # Code-search similar to ack
brew "tig" # Text interface for Git repositories
brew "tilt-dev/tap/ctlptl" # Making local Kubernetes clusters easy to set up and tear down
brew "tilt-dev/tap/tilt" # A dev environment as code for microservice apps
brew "tmate" # Instant terminal sharing
brew "tnef" # Microsoft MS-TNEF attachment unpacker
brew "turbot/tap/steampipe" # Steampipe exposes APIs and services as a high-performance relational database, giving you the ability to write SQL-based queries to explore, assess and report on dynamic data.
brew "tz" # CLI time zone visualizer
brew "universal-ctags" # Maintained ctags implementation
brew "watch" # Executes a program periodically, showing output fullscreen
brew "watchexec" # Execute commands when watched files change
brew "wget" # Internet file retriever
brew "xmlstarlet" # XML command-line utilities
brew "xq" # Command-line XML and HTML beautifier and content extractor
brew "xz" # General-purpose data compression with high compression ratio
brew "yamllint" # Linter for YAML files
brew "yq" # Process YAML documents from the CLI

cask "alacritty" # GPU-accelerated terminal emulator
cask "alfred" # Application launcher and productivity software
cask "anki" # Spaced repetition flashcards
cask "anydesk" # Allows connection to a computer remotely
cask "bbedit" # Text, code, and markup editor
cask "calibre" # E-books management software
cask "charles" # Web debugging Proxy application
cask "darktable" # Lightroom alternative
cask "deeper" # Deep OS Personalization
cask "devcleaner" # Xcode dev cleaner
cask "dosbox" # DOS Emulator
cask "eaglefiler" # Organize files, archive e-mails, save Web pages and notes, search everything
cask "finicky" # Utility for customizing which browser to start
cask "firefox" # Web browser
cask "firefox-developer-edition" # Web browser
cask "fluid" # Tool to turn a website into a desktop app
cask "fvim" # F# Vim
cask "gargoyle" # A cross-platform IO layer for an interactive fiction player
cask "google-chrome" # Web browser
cask "gpg-suite-no-mail" # Tools to protect your files
cask "hazel" # Automated organization
cask "hex-fiend" # Hex Editor
cask "insomnia" # HTTP and GraphQL Client
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
cask "itsycal" # Menu bar calendar
cask "keyboardcleantool" # A keyboard cleaning tool
cask "keycastr" # Open-source keystroke visualizer
cask "kindle-previewer" # Preview and audit Kindle eBooks
cask "koa11y" # Easily check for website accessibility issues
cask "lapce" # Lightning-fast and Powerful Code Editor
cask "linphone" # Software for communication systems developers
cask "macvim" # Text editor
cask "microsoft-edge" # Web browser
cask "modern-csv" # CSV editor
cask "monitorcontrol" # Control external display brightness and volume
cask "monodraw" # Tool to create text-based art
cask "moom" # Utility to move and zoom windows—on one display
cask "notion" # App to write, plan, collaborate, and get organized
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files
cask "opera-developer" # Web browser
cask "orbstack" # Replacement for Docker Desktop
cask "podman-desktop" # Podman Desktop
cask "publii" # Static site CMS
cask "qlcolorcode" # QuickLook plug-in that renders source code with syntax highlighting
cask "qlimagesize" # Display image info and preview unsupported formats in QuickLook
cask "qlmarkdown" # QuickLook generator for Markdown files
cask "qlstephen" # Quicklook plaintext files without a file extension
cask "qlvideo" # Quicklook previews of video files
cask "quicklook-json" # QuickLook support for JSON
cask "rancher" # Kubernetes and container management on the desktop
cask "rawtherapee" # Raw image processing
cask "resolutionator" # Use any of your display's available resolutions
cask "responsively" # Modified browser that helps in responsive web development
cask "safari-technology-preview" # Web browser
cask "scrivener" # Word processing software with a typewriter style
cask "setapp" # Collection of apps available by subscription
cask "shortcat" # App that enables mouse-free UI interaction
cask "shottr" # Screenshot tool
cask "slack" # Team communication and collaboration software
cask "spatterlight" # Interactive Fiction Player
cask "tableflip" # App to edit markdown files in place
cask "tad" # Desktop application for viewing and analyzing tabular data
cask "utm" # Virtual machines UI using QEMU
cask "vimr" # GUI for the Neovim text editor
cask "viscosity" # OpenVPN client with AppleScript support
cask "visual-studio-code" # Open-source code editor
cask "vivaldi" # Web browser focusing on customization and control
cask "webpquicklook" # QuickLook for WebP
cask "wezterm" # GPU-accelerated cross-platform terminal emulator and multiplexer
cask "xcodes" # Install and switch between multiple versions of Xcode

## Fonts
cask "font-anka-coder"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-charis-sil"
cask "font-cormorant-garamond"
cask "font-courier-prime"
cask "font-courier-prime-code"
cask "font-courier-prime-medium-and-semi-bold"
cask "font-courier-prime-sans"
cask "font-dm-mono"
cask "font-dm-sans"
cask "font-dm-serif-display"
cask "font-dm-serif-text"
cask "font-eb-garamond"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hasklig"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-inconsolata"
cask "font-input"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-monofur-for-powerline"
cask "font-monoid"
cask "font-mononoki"
cask "font-pt-serif"
cask "font-recursive"
cask "font-recursive-code"
cask "font-source-serif-pro"
cask "font-space-mono"
cask "font-sudo"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono"

mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Abyss", id: 1507396839
mas "Acorn", id: 1547371478
mas "Actions", id: 1586435171
mas "Byword", id: 420212497
mas "Calca", id: 635758264
mas "CARROT Weather", id: 993487541
mas "Craft", id: 1487937127
mas "Data Jar", id: 1453273600
mas "Deliveries", id: 290986013
mas "Developer", id: 640199958
mas "Esse", id: 1438921989
mas "Exporter", id: 1099120373
mas "GarageBand", id: 682658836
mas "Grim Fandango", id: 1022841309
mas "Grocery", id: 1195676848
mas "History Book", id: 1619241039
mas "Icon Slate", id: 439697913
mas "Image2icon", id: 992115977
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Mactracker", id: 430255202
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "MenubarX", id: 1575588022
mas "Mimeo Photos", id: 1282504627
mas "Muse", id: 1501563902
mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Parcel", id: 639968404
mas "PCalc", id: 403504866
mas "Pinboard Tools", id: 1552590875
mas "PiPifier", id: 1160374471
mas "Pixelmator Pro", id: 1289583905
mas "PopClip", id: 445189367
mas "Shareful", id: 1522267256
mas "Svgsus", id: 1106867065
mas "System Strings", id: 570467776
mas "Typeface", id: 1062679359
mas "Vinegar", id: 1591303229
mas "WorldWideWeb", id: 1621370168
mas "xScope", id: 889428659
mas "Zen Pinball Party", id: 1536783591
