edc/bass
0rax/fish-bd
OakNinja/MakeMeFish
alyyousuf7/plugin-epwd
evanlucas/fish-kubectl-completions
franciscolourenco/done
gokulsoumya/f
halostatue/fish-battery@v1.x
halostatue/fish-brew@v2.x
halostatue/fish-direnv@v1.x
halostatue/fish-docker@v1.x
halostatue/fish-elixir@v1.x
halostatue/fish-go@v2.x
halostatue/fish-haskell@v2.x
halostatue/fish-kerl@v1.x
halostatue/fish-macos@v2.x
halostatue/fish-rake@v1.x
halostatue/fish-rust@v1.x
halostatue/fish-utils-core@v1.x
halostatue/fish-utils@v2.x
jethrokuan/z
PatrickF1/fzf.fish
jorgebucaran/replay.fish
jorgebucaran/fishtape
jorgebucaran/getopts.fish
jorgebucaran/nvm.fish
jorgebucaran/spark.fish
laughedelic/brew-completions
jorgebucaran/autopair.fish
matchai/fish-mock
nju33/fish-age
oh-my-fish/plugin-cd
oh-my-fish/plugin-license
oh-my-fish/plugin-tab
PatrickF1/colored_man_pages.fish
sijad/gitignore
IlanCosman/spout
halostatue/fish-utils-net@v1.x
halostatue/plugin-aws@patch-1
lilyball/nix-env.fish
jorgebucaran/gitio.fish
jorgebucaran/humantime.fish
