franciscolourenco/done
halostatue/fish-brew@v2.x
halostatue/fish-docker@v1.x
halostatue/fish-elixir@v1.x
halostatue/fish-go@v2.x
halostatue/fish-haskell@v2.x
halostatue/fish-kerl@v1.x
halostatue/fish-rake@v1.x
halostatue/fish-rust@v1.x
halostatue/fish-utils@v2.x
PatrickF1/fzf.fish
jorgebucaran/fishtape
jorgebucaran/nvm.fish
jorgebucaran/autopair.fish
oh-my-fish/plugin-tab
PatrickF1/colored_man_pages.fish
halostatue/fish-utils-net@v1.x
lilyball/nix-env.fish
IlanCosman/clownfish
IlanCosman/tide@v5
halostatue/fish-macos@v4.x
reitzig/sdkman-for-fish
jorgebucaran/fisher
halostatue/fish-machine-config@v1.x
halostatue/fish-utils-core
halostatue/fish-utils-core@v2.x
halostatue/fish-direnv@v1.x
