edc/bass
0rax/fish-bd
OakNinja/MakeMeFish
alyyousuf7/plugin-epwd
evanlucas/fish-kubectl-completions
franciscolourenco/done
gokulsoumya/f
halostatue/fish-battery@v1.x
halostatue/fish-brew@v1.x
halostatue/fish-direnv@v1.x
halostatue/fish-docker@v1.x
halostatue/fish-elixir@v1.x
halostatue/fish-fzf@v2.x
halostatue/fish-go@v1.x
halostatue/fish-haskell@v1.x
halostatue/fish-kerl@v1.x
halostatue/fish-kiex@v1.x
halostatue/fish-macos@v2.x
halostatue/fish-rake@v1.x
halostatue/fish-rust@v1.x
halostatue/fish-ssh-agent@v1.x
halostatue/fish-utils-core@v1.x
halostatue/fish-utils-net@v1.x
halostatue/fish-utils@v2.x
jethrokuan/fzf
jethrokuan/z
jorgebucaran/bax.fish
jorgebucaran/fishtape
jorgebucaran/getopts.fish
jorgebucaran/nvm.fish
jorgebucaran/spark.fish
laughedelic/brew-completions
laughedelic/pisces
matchai/fish-mock
nju33/fish-age
oh-my-fish/plugin-aws
oh-my-fish/plugin-cd
oh-my-fish/plugin-license
oh-my-fish/plugin-tab
PatrickF1/colored_man_pages.fish
sijad/gitignore
IlanCosman/spout
